{
  "architectures": [
    "Lfm2VlForConditionalGeneration"
  ],
  "do_image_splitting": true,
  "downsample_factor": 2,
  "dtype": "float32",
  "encoder_patch_size": 16,
  "image_token_id": 396,
  "image_token_index": 396,
  "max_image_tokens": 256,
  "max_num_patches": 1024,
  "max_pixels_tolerance": 2.0,
  "max_tiles": 10,
  "min_image_tokens": 64,
  "min_tiles": 2,
  "model_type": "lfm2_vl",
  "projector_bias": true,
  "projector_hidden_act": "gelu",
  "projector_hidden_size": 2560,
  "projector_use_layernorm": true,
  "quantization_config": {
    "_load_in_4bit": true,
    "_load_in_8bit": false,
    "bnb_4bit_compute_dtype": "bfloat16",
    "bnb_4bit_quant_storage": "uint8",
    "bnb_4bit_quant_type": "nf4",
    "bnb_4bit_use_double_quant": true,
    "llm_int8_enable_fp32_cpu_offload": false,
    "llm_int8_has_fp16_weight": false,
    "llm_int8_skip_modules": [
      "patch_embedding",
      "lm_head"
    ],
    "llm_int8_threshold": 6.0,
    "load_in_4bit": true,
    "load_in_8bit": false,
    "quant_method": "bitsandbytes"
  },
  "text_config": {
    "_name_or_path": "LiquidAI/LFM2-350M",
    "architectures": [
      "Lfm2ForCausalLM"
    ],
    "block_auto_adjust_ff_dim": true,
    "block_dim": 1024,
    "block_ff_dim": 6656,
    "block_ffn_dim_multiplier": 1.0,
    "block_mlp_init_scale": 1.0,
    "block_multiple_of": 256,
    "block_norm_eps": 1e-05,
    "block_out_init_scale": 1.0,
    "block_use_swiglu": true,
    "block_use_xavier_init": true,
    "bos_token_id": 1,
    "conv_L_cache": 3,
    "conv_bias": false,
    "conv_dim": 1024,
    "conv_dim_out": 1024,
    "conv_use_xavier_init": true,
    "dtype": "bfloat16",
    "eos_token_id": 7,
    "hidden_size": 1024,
    "initializer_range": 0.02,
    "intermediate_size": 6656,
    "layer_types": [
      "conv",
      "conv",
      "full_attention",
      "conv",
      "conv",
      "full_attention",
      "conv",
      "conv",
      "full_attention",
      "conv",
      "full_attention",
      "conv",
      "full_attention",
      "conv",
      "full_attention",
      "conv"
    ],
    "max_position_embeddings": 128000,
    "model_type": "lfm2",
    "norm_eps": 1e-05,
    "num_attention_heads": 16,
    "num_heads": 16,
    "num_hidden_layers": 16,
    "num_key_value_heads": 8,
    "pad_token_id": 0,
    "rope_parameters": {
      "rope_theta": 1000000.0,
      "rope_type": "default"
    },
    "tie_word_embeddings": true,
    "use_cache": true,
    "use_pos_enc": true,
    "vocab_size": 65536
  },
  "tie_word_embeddings": true,
  "tile_size": 512,
  "transformers_version": "5.3.0",
  "use_image_special_tokens": true,
  "use_thumbnail": false,
  "vision_config": {
    "attention_dropout": 0.0,
    "dtype": "bfloat16",
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 768,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-06,
    "model_type": "siglip2_vision_model",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "num_patches": 256,
    "patch_size": 16,
    "vision_use_head": false
  }
}
